src/cf/Catalogs/Задачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Задачи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Решена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПроекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Блокеры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Задача</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/КэшированныеРеквизитыРодителейЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КэшированныеРеквизитыРодителейЗадач</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Решена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПроекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/Задачи/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий //EventHandlers
Процедура ПередЗаписью(Отказ)
	
	ЧтоМенять = Новый Структура;
	КонтролируемыеРеквизитыСтрокой = СтрСоединить(РегистрыСведений.КэшированныеРеквизитыРодителейЗадач.КонтролируемыеРеквизиты(), ", ");
	Если Не ЭтоНовый() Тогда 
		// Если меняется не родитель, то только по своим данным заполняем детей
		ПрошлыеЗначения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, КонтролируемыеРеквизитыСтрокой, Истина);
		Для Каждого КЗ из ПрошлыеЗначения Цикл
			Если КЗ.Значение <> ЭтотОбъект[Кз.Ключ] Тогда
				ЧтоМенять.Вставить(КЗ.Ключ, ЭтотОбъект[Кз.Ключ]);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ЭтоНовый() и ЗначениеЗаполнено(Родитель) Тогда
		НоваяСсылка = Справочники.Задачи.ПолучитьСсылку(Новый УникальныйИдентификатор);
		ЭтотОбъект.УстановитьСсылкуНового(НоваяСсылка);
	Иначе
		НоваяСсылка = Ссылка;
	КонецЕсли;

	
	// если меняется родитель - все, звиздец полный пересчет
	Если ЧтоМенять.Свойство("Родитель") 
		Или (ЭтоНовый() и ЗначениеЗаполнено(Родитель))
		Тогда
		ЧтоМенять = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Родитель, КонтролируемыеРеквизитыСтрокой, Истина);

		ДанныеКэша = ДанныеКэша(ЭтотОбъект.Родитель);
		ЧтоМенять.Удалить("Родитель");
		Для Каждого КЗ из ЧтоМенять Цикл
			Если Не ЗначениеЗаполнено(КЗ.Значение) или КЗ.Значение = Ложь Тогда
				ЧтоМенять[КЗ.Ключ] = ДанныеКэша[КЗ.Ключ];
			КонецЕсли;
		КонецЦикла;
		
		ОбновитьКэш(ЧтоМенять, НоваяСсылка);
		// здесь мы не восстанавливаем разницу с начальным списком, а уточняем разницу с текущим родителем
		ЧтоМенять = УточнитьЧтоМенять(ЧтоМенять, ЭтотОбъект); 
	КонецЕсли;

	//Если ЭтоНовый() и ЗначениеЗаполнено(Родитель) Тогда
	//	// Просто обновляем кэш для этой позиции
	//	ЧтоМенять = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Родитель, КонтролируемыеРеквизитыСтрокой, Истина);
	//	ЧтоМенять.Удалить("Родитель");
	//	ОбновитьКэш(ЧтоМенять, НоваяСслка);
	//КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЧтоМенять", ЧтоМенять);
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
		
	Если ДополнительныеСвойства.ЧтоМенять.Количество() <> 0 Тогда
		ОбновитьДетей(ДополнительныеСвойства.ЧтоМенять, Ссылка);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти //ОбработчикиСобытий //EventHandlers

#Область СлужебныеПроцедурыИФункции //Private
Процедура ОбновитьДетей(вхЧтоМенять, СсылкаРодителя)
	Перем Запрос;
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Родитель", СсылкаРодителя);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Задачи.Ссылка КАК Ссылка,
	|	1 КАК ПоследняяКолонка
	|ИЗ
	|	Справочник.Задачи КАК Задачи
	|ГДЕ
	|	Задачи.Родитель = &Родитель"
	;
	
	// Дополнить данными из что менять
	ТекстДопКолонок = Новый Массив;
	Для Каждого КЗ из вхЧтоМенять Цикл
		СтрокаКолонки = стрШаблон("Задачи.%1 как %1", КЗ.Ключ);
		ТекстДопКолонок.Добавить(СтрокаКолонки);
	КонецЦикла;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 КАК ПоследняяКолонка", СтрСоединить(ТекстДопКолонок, ", "));
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбработатьСсылкуИПотомков(вхЧтоМенять, Выборка);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьСсылкуИПотомков(Знач вхЧтоМенять, Знач ДанныеОбъекта)
	
	Перем ЧтоМенять;
	
	// 1. Обновить кэш
	ОбновитьКэш(вхЧтоМенять, ДанныеОбъекта.Ссылка);
	// 2. Обновить внуков если надо
	ЧтоМенять = УточнитьЧтоМенять(вхЧтоМенять, ДанныеОбъекта);
	
	Если ЧтоМенять.Количество() <> 0 Тогда 
		ОбновитьДетей(ЧтоМенять, ДанныеОбъекта.Ссылка);
	КонецЕсли;

КонецПроцедуры

Функция УточнитьЧтоМенять(Знач вхЧтоМенять, Знач ДанныеОбъекта)
	
	Перем КЗ, ЧтоМенять;
	
	ЧтоМенять = Новый Структура;
	Для Каждого КЗ из вхЧтоМенять Цикл
		Если Не ЗначениеЗаполнено(ДанныеОбъекта[КЗ.Ключ]) или ДанныеОбъекта[КЗ.Ключ] = Ложь Тогда
			ЧтоМенять.Вставить(КЗ.Ключ, КЗ.Значение);
		КонецЕсли;
	КонецЦикла;
	Возврат ЧтоМенять;

КонецФункции

Процедура ОбновитьКэш(Знач вхЧтоМенять, Знач Ссылка)
	
	Перем МенеджерЗаписи;
	
	МенеджерЗаписи = РегистрыСведений.КэшированныеРеквизитыРодителейЗадач.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Задача = Ссылка;
	МенеджерЗаписи.Прочитать();
	Если Не МенеджерЗаписи.Выбран() Тогда // сбросилось
		МенеджерЗаписи.Задача = Ссылка;
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, вхЧтоМенять);
	МенеджерЗаписи.Записать();

КонецПроцедуры

Функция ДанныеКэша(Задача)
	Перем Рез;
	Перем Запрос;
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Задача", Задача);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КэшированныеРеквизитыРодителейЗадач.Задача КАК Задача,
	|	КэшированныеРеквизитыРодителейЗадач.Решена КАК Решена,
	|	КэшированныеРеквизитыРодителейЗадач.Срок КАК Срок,
	|	КэшированныеРеквизитыРодителейЗадач.КодПроекта КАК КодПроекта,
	|	КэшированныеРеквизитыРодителейЗадач.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	РегистрСведений.КэшированныеРеквизитыРодителейЗадач КАК КэшированныеРеквизитыРодителейЗадач
	|ГДЕ
	|	КэшированныеРеквизитыРодителейЗадач.Задача = &Задача"
	;
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();

	Возврат Выборка;
КонецФункции

#КонецОбласти //СлужебныеПроцедурыИФункции //Private
